vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA345_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy" Cversion="1.0.0" condition="component.mem_manager_legacy.condition_id">
      <description>Component mem_manager_legacy</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light" Cversion="1.0.0" condition="component.mem_manager_light.condition_id">
      <description>Component mem_manager_light</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager_light.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="messaging" Cversion="1.0.0" condition="component.messaging.condition_id">
      <description>Component messaging</description>
      <files>
        <file category="header" name="components/messaging/fsl_component_messaging.h" projectpath="component/messaging"/>
        <file category="sourceC" name="components/messaging/fsl_component_messaging.c" projectpath="component/messaging"/>
        <file category="include" name="components/messaging/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_offchip" Cversion="1.0.0" condition="component.mflash_offchip.condition_id">
      <description>mflash offchip</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_offchip_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip" Cversion="1.0.0" condition="component.mflash_onchip.condition_id">
      <description>mflash onchip</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_onchip_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip_fmu" Cversion="1.0.0" condition="component.mflash_onchip_fmu.condition_id">
      <description>mflash onchip_fmu</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_onchip_fmu_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter" Cversion="1.0.0" condition="component.ostimer_adapter.condition_id">
      <description>Component ostimer_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_OSTIMER
#define TIMER_PORT_TYPE_OSTIMER 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_ostimer.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_time_stamp_adapter" Cversion="1.0.0" condition="component.ostimer_time_stamp_adapter.condition_id">
      <description>Component ostimer time stamp adapter</description>
      <files>
        <file category="header" name="components/time_stamp/fsl_adapter_time_stamp.h" projectpath="component/time_stamp"/>
        <file category="sourceC" name="components/time_stamp/fsl_adapter_ostimer_time_stamp.c" projectpath="component/time_stamp"/>
        <file category="include" name="components/time_stamp/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="component.panic.condition_id">
      <description>Component panic</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h" projectpath="component/panic"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c" projectpath="component/panic"/>
        <file category="include" name="components/panic/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power_manager_core" Cversion="2.0.0" condition="component.power_manager_framework.condition_id">
      <description>Component power manager core level</description>
      <RTE_Components_h>
#ifndef GENERIC_LIST_LIGHT
#define GENERIC_LIST_LIGHT 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/power_manager/core/fsl_pm_core.h" projectpath="component/power_manager"/>
        <file category="sourceC" name="components/power_manager/core/fsl_pm_core.c" projectpath="component/power_manager"/>
        <file category="header" name="components/power_manager/core/fsl_pm_config.h" projectpath="component/power_manager"/>
        <file category="include" name="components/power_manager/core/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset_adapter" Cversion="1.0.0" condition="component.reset_adapter.condition_id">
      <description>Component reset_adapter</description>
      <files>
        <file category="header" name="components/reset/fsl_adapter_reset.h" projectpath="component/reset"/>
        <file category="sourceC" name="components/reset/fsl_adapter_reset.c" projectpath="component/reset"/>
        <file category="include" name="components/reset/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.1" condition="component.serial_manager.condition_id">
      <description>Component serial_manager</description>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_manager.h" projectpath="component/serial_manager"/>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_internal.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_manager.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi" Cversion="1.0.0" condition="component.serial_manager_spi.condition_id">
      <description>Component serial_manager_spi</description>
      <RTE_Components_h>
        #ifndef SERIAL_PORT_TYPE_SPI
        #define SERIAL_PORT_TYPE_SPI 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_MASTER
        #define SERIAL_PORT_TYPE_SPI_MASTER 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_SLAVE
        #define SERIAL_PORT_TYPE_SPI_SLAVE 1
        #endif
        #ifndef SERIAL_MANAGER_NON_BLOCKING_MODE
        #define SERIAL_MANAGER_NON_BLOCKING_MODE 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_spi.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_spi.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo" Cversion="1.0.0" condition="component.serial_manager_swo.condition_id">
      <description>Component serial_manager_swo</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SWO
#define SERIAL_PORT_TYPE_SWO 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_swo.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_swo.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="component.serial_manager_uart.condition_id">
      <description>Component serial_manager_uart</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_UART
#define SERIAL_PORT_TYPE_UART 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_uart.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_uart.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual" Cversion="1.0.0" condition="component.serial_manager_virtual.condition_id">
      <description>Component serial_manager_virtual</description>
      <RTE_Components_h>
        #ifndef SSERIAL_PORT_TYPE_VIRTUAL
        #define SSERIAL_PORT_TYPE_VIRTUAL 1
        #endif
        #ifndef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_virtual.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_virtual.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_aead" Cversion="1.0.0" condition="component.sgi_pkc.aead.condition_id">
      <description>Component sgi_pkc.aead</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAead/src/mcuxClAead.c" projectpath="component/sgi_pkc/src/comps/mcuxClAead/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAead/inc/mcuxClAead.h" projectpath="component/sgi_pkc/src/comps/mcuxClAead/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAead/inc/mcuxClAead_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClAead/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAead/inc/mcuxClAead_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClAead/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAead/inc/mcuxClAead_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClAead/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAead/inc/internal/mcuxClAead_Ctx.h" projectpath="component/sgi_pkc/src/comps/mcuxClAead/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAead/inc/internal/mcuxClAead_Descriptor.h" projectpath="component/sgi_pkc/src/comps/mcuxClAead/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClAead/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClAead/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_aead_modes" Cversion="1.0.0" condition="component.sgi_pkc.aead_modes.condition_id">
      <description>Component sgi_pkc.aead_modes</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Sgi_Ccm.c" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Sgi_Cleanup.c" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Sgi_Common.c" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Sgi_Gcm.c" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Sgi_Modes.c" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Sgi_Multipart.c" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAeadModes/src/mcuxClAeadModes_Sgi_Oneshot.c" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAeadModes/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/mcuxClAeadModes.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/mcuxClAeadModes_Modes.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Common.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Common_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Common_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Common_Wa.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Sgi_Algorithms.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Sgi_Cleanup.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Sgi_Ctx.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Sgi_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/mcuxClAeadModes_Sgi_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClAeadModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_aes" Cversion="1.0.0" condition="component.sgi_pkc.aes.condition_id">
      <description>Component aes</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAes/src/mcuxClAes_KeyEncodingMechanisms_Sgi.c" projectpath="component/sgi_pkc/src/comps/mcuxClAes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAes/src/mcuxClAes_KeyHelper_Sgi.c" projectpath="component/sgi_pkc/src/comps/mcuxClAes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAes/src/mcuxClAes_KeyTypes.c" projectpath="component/sgi_pkc/src/comps/mcuxClAes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClAes/src/mcuxClAes_SecurityUtils_Sgi.c" projectpath="component/sgi_pkc/src/comps/mcuxClAes/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/mcuxClAes.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/mcuxClAes_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/mcuxClAes_KeyEncodingMechanisms.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/mcuxClAes_KeyTypes.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/mcuxClAes_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Ctx.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Internal_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_KeyEncodingMechanisms_Sgi.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Wa.h" projectpath="component/sgi_pkc/src/comps/mcuxClAes/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClAes/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClAes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer" Cversion="1.0.0" condition="component.sgi_pkc.buffer.condition_id">
      <description>Component buffer</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClBuffer/src/mcuxClBuffer.c" projectpath="component/sgi_pkc/src/comps/mcuxClBuffer/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer.h" projectpath="component/sgi_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer_Cfg.h" projectpath="component/sgi_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer_Impl.h" projectpath="component/sgi_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/mcuxClBuffer_Pointer.h" projectpath="component/sgi_pkc/src/comps/mcuxClBuffer/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/internal/mcuxClBuffer_FeatureConfig.h" projectpath="component/sgi_pkc/src/comps/mcuxClBuffer/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/internal/mcuxClBuffer_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClBuffer/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/internal/mcuxClBuffer_Internal_Pointer.h" projectpath="component/sgi_pkc/src/comps/mcuxClBuffer/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher" Cversion="1.0.0" condition="component.sgi_pkc.cipher.condition_id">
      <description>Component sgi_pkc.cipher</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipher/src/mcuxClCipher.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipher/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipher/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipher/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipher/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipher/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipher/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipher/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClCipher/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClCipher/inc/internal/"/>
      </files>
    </component>
