vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA345_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_session" Cversion="1.0.0" condition="component.sgi_pkc.session.condition_id">
      <description>Component sgi_pkc.session</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/mcuxClSession.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/mcuxClSession_jobHandling.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/size"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxClSession/src/asm/mcuxClSession_Internal_EntryExit_EarlyExit_Entry_arm.S" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/asm"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxClSession/src/asm/mcuxClSession_Internal_EntryExit_EarlyExit_Return_arm.S" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/asm"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_FeatureConfig.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_EarlyExit.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_EarlyExit_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSession/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_sgi_pkc" Cversion="1.0.0" condition="component.sgi_pkc.sgi_pkc.condition_id">
      <description>Component sgi_pkc</description>
      <files>
        <file category="doc" name="components/sgi_pkc/component.sgi_pkc.sgi_pkc_dummy.txt"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_signature" Cversion="1.0.0" condition="component.sgi_pkc.signature.condition_id">
      <description>Component sgi_pkc.signature</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSignature/src/mcuxClSignature.c" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSignature/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/internal/mcuxClSignature_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain" Cversion="1.0.0" condition="component.sgi_pkc.toolchain.condition_id">
      <description>Component sgi_pkc toolchain</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/compiler/mcuxClToolchain.h" projectpath="component/sgi_pkc/src/compiler"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/compiler/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
