vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA345_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA345_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXA345_cmsis</description>
      <files>
        <file category="header" name="devices/MCXA345/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXA345/MCXA345.h" projectpath="device"/>
        <file category="header" name="devices/MCXA345/MCXA345_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXA345/MCXA345_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_AOI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_CAN.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_CDOG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_CMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_CRC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_CTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_DEBUGMAILBOX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_DIGTMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_EIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_EQDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_ERM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_FLEXIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_FMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_FMU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_FREQME.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_GLIKEY.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_I3C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_INPUTMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_LCD.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_LPCMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_LPDAC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_LPI2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_LPSPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_LPTMR.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_LPUART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_MAU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_MRCC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_OPAMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_OSTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_PKC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_PORT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_PWM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_SCG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_SGI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_SMARTDMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_SPC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_SYSCON.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_TRDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_TRNG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_UDF.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_USB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_UTICK.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_VBAT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_WAKETIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_WUU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA345/periph2/PERI_WWDT.h" projectpath="device/periph2"/>
        <file category="include" name="devices/MCXA345/"/>
        <file category="include" name="devices/MCXA345/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA345/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA345/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA345_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA345_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA345.condition_id" category="linkerScript" name="devices/MCXA345/arm/MCXA345_flash.scf" projectpath="MCXA345/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA345.condition_id" category="linkerScript" name="devices/MCXA345/arm/MCXA345_ram.scf" projectpath="MCXA345/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA345.condition_id" category="linkerScript" name="devices/MCXA345/gcc/MCXA345_flash.ld" projectpath="MCXA345/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA345.condition_id" category="linkerScript" name="devices/MCXA345/gcc/MCXA345_ram.ld" projectpath="MCXA345/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA345.condition_id" category="linkerScript" name="devices/MCXA345/iar/MCXA345_flash.icf" projectpath="MCXA345/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA345.condition_id" category="linkerScript" name="devices/MCXA345/iar/MCXA345_ram.icf" projectpath="MCXA345/iar"/>
      </files>
    </component>
